EJECUCIONES/JMX/Dinamica.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.2.1">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Prueba De Imágen Grande" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
    </TestPlan>
    <hashTree>
      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="Valores por Defecto para Petición HTTP" enabled="true">
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
          <collectionProp name="Arguments.arguments"/>
        </elementProp>
        <stringProp name="HTTPSampler.domain">virtual.lab.inf.uva.es</stringProp>
        <stringProp name="HTTPSampler.port">31332</stringProp>
        <stringProp name="HTTPSampler.protocol">http</stringProp>
        <stringProp name="HTTPSampler.concurrentPool">6</stringProp>
        <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
        <stringProp name="HTTPSampler.connect_timeout">600000</stringProp>
        <stringProp name="HTTPSampler.response_timeout">600000</stringProp>
      </ConfigTestElement>
      <hashTree/>
      <kg.apc.jmeter.perfmon.PerfMonCollector guiclass="kg.apc.jmeter.vizualizers.PerfMonGui" testclass="kg.apc.jmeter.perfmon.PerfMonCollector" testname="jp@gc - PerfMon Metrics Collector" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">${__P(FILE,scriptresultsPerfmonDin15.jtl)}</stringProp>
        <longProp name="interval_grouping">1000</longProp>
        <boolProp name="graph_aggregated">false</boolProp>
        <boolProp name="include_checkbox_state">false</boolProp>
        <boolProp name="exclude_checkbox_state">false</boolProp>
        <collectionProp name="metricConnections">
          <collectionProp name="-1436972914">
            <stringProp name="820435565">virtual.lab.inf.uva.es</stringProp>
            <stringProp name="48609974">31334</stringProp>
            <stringProp name="66952">CPU</stringProp>
            <stringProp name="-612455675">combined</stringProp>
          </collectionProp>
          <collectionProp name="-1242513980">
            <stringProp name="820435565">virtual.lab.inf.uva.es</stringProp>
            <stringProp name="48609974">31334</stringProp>
            <stringProp name="-1993889503">Memory</stringProp>
            <stringProp name="-278579165">usedperc</stringProp>
          </collectionProp>
          <collectionProp name="1758441471">
            <stringProp name="820435565">virtual.lab.inf.uva.es</stringProp>
            <stringProp name="48609974">31334</stringProp>
            <stringProp name="2112896831">Disks I/O</stringProp>
            <stringProp name="108386717">reads</stringProp>
          </collectionProp>
          <collectionProp name="-753740903">
            <stringProp name="820435565">virtual.lab.inf.uva.es</stringProp>
            <stringProp name="48609974">31334</stringProp>
            <stringProp name="2112896831">Disks I/O</stringProp>
            <stringProp name="-779574156">writes</stringProp>
          </collectionProp>
          <collectionProp name="-1399187424">
            <stringProp name="820435565">virtual.lab.inf.uva.es</stringProp>
            <stringProp name="48609974">31334</stringProp>
            <stringProp name="2590131">Swap</stringProp>
            <stringProp name="3599293">used</stringProp>
          </collectionProp>
        </collectionProp>
      </kg.apc.jmeter.perfmon.PerfMonCollector>
      <hashTree/>
      <kg.apc.jmeter.threads.UltimateThreadGroup guiclass="kg.apc.jmeter.threads.UltimateThreadGroupGui" testclass="kg.apc.jmeter.threads.UltimateThreadGroup" testname="jp@gc - Ultimate Thread Group" enabled="true">
        <collectionProp name="ultimatethreadgroupdata">
          <collectionProp name="-1826832439">
            <stringProp name="-1701399666">${__P(HILOS1,5)}</stringProp>
            <stringProp name="-1643841931">${__P(DELAY1,0)}</stringProp>
            <stringProp name="1503913368">${__P(SUBIDA1,4)}</stringProp>
            <stringProp name="1979183411">${__P(DURACION1,130)}</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="-442133141">
            <stringProp name="-1700476145">${__P(HILOS2,5)}</stringProp>
            <stringProp name="-1642913605">${__P(DELAY2,5)}</stringProp>
            <stringProp name="1504835928">${__P(SUBIDA2,3)}</stringProp>
            <stringProp name="-1428305190">${__P(DURACION2,125)}</stringProp>
            <stringProp reference="../../collectionProp/stringProp[5]"/>
          </collectionProp>
          <collectionProp name="-504858695">
            <stringProp name="-1699552624">${__P(HILOS3,5)}</stringProp>
            <stringProp name="637800032">${__P(DELAY3,10)}</stringProp>
            <stringProp name="1505759449">${__P(SUBIDA3,3)}</stringProp>
            <stringProp name="-540806314">${__P(DURACION3,120)}</stringProp>
            <stringProp reference="../../collectionProp/stringProp[5]"/>
          </collectionProp>
        </collectionProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
      </kg.apc.jmeter.threads.UltimateThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Petición2 HTTP" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.path">/test/phptestotal.php</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <boolProp name="HTTPSampler.BROWSER_COMPATIBLE_MULTIPART">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>